### Pandas is a powerful python library used for data manipulation and analysis
 ####  It offers powerful and flexible data structure such as series(1D) and Dataframe(2D)

In [1]:
import pandas as pd
import numpy as np

##### Creating Series Manually

In [2]:
s = pd.Series([10, 20, 30, 40, 50], index = ('a', 'b', 'c', 'd', 'e'))
print(s)
print(s['a'])

a    10
b    20
c    30
d    40
e    50
dtype: int64
10

In [4]:
prices = [700000, 8900000, 1400000]
car_name = ['Boleno', 'BMW', 'Scarpio']
car_series = pd.Series(prices, car_name)
print(car_series)

Boleno      700000
BMW        8900000
Scarpio    1400000
dtype: int64

In [62]:
type(car_series)

pandas.core.series.Series

In [24]:
print(pd.Series(prices))

0     700000
1    8900000
2    1400000
dtype: int64

In [32]:
car_series = pd.Series(data = prices, index = car_name, name = 'prices')
print(car_series)

Boleno      700000
BMW        8900000
Scarpio    1400000
Name: prices, dtype: int64

##### Creating series from dictionary

In [14]:
data_car = {
    'Boleno': 900000,
    'Audi': 600000,
    'Bolero': 1200000,
    'Santro': 310000,
    'Nano': 190000
}

car_series = pd.Series(data_car, name= 'prices')

In [34]:
print(car_series)

Boleno     900000
Audi       600000
Bolero    1200000
Santro     310000
Nano       190000
Name: prices, dtype: int64

In [35]:
type(car_series['Audi'])

numpy.int64

In [36]:
type(car_series['Bolero'])

numpy.int64

In [37]:
len(car_series)

5

In [38]:
car_series.ndim

1

In [40]:
car_series > 1000000

Boleno    False
Audi      False
Bolero     True
Santro    False
Nano      False
Name: prices, dtype: bool

In [49]:
print(car_series[car_series > 500000])

Boleno     900000
Audi       600000
Bolero    1200000
Name: prices, dtype: int64

In [44]:
car_series[car_series > 500000].index[0]

'Boleno'

In [45]:
car_series[car_series > 500000].index[2]

'Bolero'

In [48]:
print(car_series[car_series > 500000].values[1])

600000

In [53]:
car_series[(car_series > 500000) & (car_series < 1000000)]

Boleno    900000
Audi      600000
Name: prices, dtype: int64

In [6]:
bill = [100, 250.23, 340, 124, 516]
cust_name = ['Rohan', 'Sohan', 'Mohan', 'Mohit', 'Sohit']

In [7]:
cust_info = pd.Series(bill, index = cust_name, name = 'Bill')
print(cust_info)

Rohan    100.00
Sohan    250.23
Mohan    340.00
Mohit    124.00
Sohit    516.00
Name: Bill, dtype: float64

In [9]:
print(list(cust_info[cust_info > 300].index))

['Mohan', 'Sohit']

### Accessing data from Series using .loc[] method

In [63]:
# The .loc in pandas stands for location and is a property used for label-based indexing to select or
# filter data from a DataFrame or Series. 
# It allows you to access groups of rows and columns using their assigned labels (names) rather 
# than their integer positions.

In [11]:
# While you can slice rows using df[start:end], this method is position-based. 
# If your index contains labels, you lose the safety and clarity of label-based slicing that loc provides.

In [65]:
 print(car_series.loc['Santro'])

310000

In [68]:
car_series.loc[['Santro']]

Santro    310000
Name: prices, dtype: int64

In [13]:
print(car_series)

Boleno      700000
BMW        8900000
Scarpio    1400000
dtype: int64

In [32]:
print(car_series.loc[['Boleno', 'Nano']])

Boleno    900000
Nano      190000
Name: prices, dtype: int64

In [76]:
print(car_series.loc['Audi':'Santro'])

Audi       600000
Bolero    1200000
Santro     310000
Name: prices, dtype: int64

In [17]:
print(car_series.loc[: 'Santro'])

Boleno     900000
Audi       600000
Bolero    1200000
Santro     310000
Name: prices, dtype: int64

### iloc method

In [20]:
print(car_series.iloc[1])

600000

In [21]:
print(car_series.iloc[[1]])

Audi    600000
Name: prices, dtype: int64

In [22]:
print(car_series.iloc[[1, 2, 3]])

Audi       600000
Bolero    1200000
Santro     310000
Name: prices, dtype: int64

In [23]:
print(car_series.iloc[1: 4])

Audi       600000
Bolero    1200000
Santro     310000
Name: prices, dtype: int64

In [25]:
## iloc dosen't include the stop element like loc method

In [30]:
print(car_series.iloc[: : -1])

Nano       190000
Santro     310000
Bolero    1200000
Audi       600000
Boleno     900000
Name: prices, dtype: int64

In [29]:
 print(car_series.iloc[0:5:2])

Boleno     900000
Bolero    1200000
Nano       190000
Name: prices, dtype: int64

# DataFrame

In [39]:
df = pd.DataFrame({
    'Product': ['Toothpaste', 'Soap', 'tiolet-paper'],
    'Price': [90, np.nan , 190],
    'Qunatity': [3, 7, 2]
})

In [40]:
df # it is dataframe object

        Product  Price  Qunatity
0    Toothpaste   90.0         3
1          Soap    NaN         7
2  tiolet-paper  190.0         2

In [49]:
# create csv file
# to_csv() means save the DataFrame as a CSV file
df.to_csv('Grocery_products.csv', index = False)
print('File successfully created')

# Those 0, 1, 2 are row numbers (index), not real data.

# index=False means:

# ðŸ‘‰ Do NOT save the index column

File successfully created

### Read CSV file

In [7]:
data_csv = pd.read_csv('Grocery_products.csv') # load csv file as a table(dataframe)
print(data_csv)

        Product  Price  Qunatity
0    Toothpaste     90         3
1          Soap    100         7
2  tiolet-paper    190         2

In [8]:
data_csv

        Product  Price  Qunatity
0    Toothpaste     90         3
1          Soap    100         7
2  tiolet-paper    190         2

In [14]:
print(data_csv['Price'])

0     90
1    100
2    190
Name: Price, dtype: int64

In [12]:
price = np.array(data_csv['Price'])

In [66]:
print(np.sum(price))

380

In [68]:
print(np.max(price))
print(np.min(price))

190
90

In [18]:
# Returns a DataFrame with two columns
subset_df = data_csv[['Product', 'Price']]

# Returns a Series (1D)
single_col = data_csv['Product']

# Returns a DataFrame (2D)
single_col_df = data_csv[['Product']]

single_col_df

        Product
0    Toothpaste
1          Soap
2  tiolet-paper

In [28]:
file_path = r"C:\Users\admin\first jupyter notebook\pharma_sales_data.csv"
df1 = pd.read_csv(file_path)

In [21]:
df1

   Product_ID Product_Name      Category  Sales_Units  Revenue Region
0         101   PainRelief     Analgesic        500.0  25000.0  North
1         102   CoughSyrup  Cough & Cold        300.0  12000.0  South
2         103  AntibioticX    Antibiotic          NaN  40000.0   East
3         104     VitaminD    Supplement        700.0      NaN   West
4         105  DiabetesMed      Diabetes        450.0  31500.0  North
5         106      Antacid     Digestive          NaN  18000.0  South
6         107  AllergyPill       Allergy        600.0      NaN   East
7         108      FluShot       Vaccine        800.0  56000.0   West

In [29]:
df1.head() # it print top 5 rows

   Product_ID Product_Name      Category  Sales_Units  Revenue Region
0         101   PainRelief     Analgesic        500.0  25000.0  North
1         102   CoughSyrup  Cough & Cold        300.0  12000.0  South
2         103  AntibioticX    Antibiotic          NaN  40000.0   East
3         104     VitaminD    Supplement        700.0      NaN   West
4         105  DiabetesMed      Diabetes        450.0  31500.0  North

In [23]:
df1.head(3)

   Product_ID Product_Name      Category  Sales_Units  Revenue Region
0         101   PainRelief     Analgesic        500.0  25000.0  North
1         102   CoughSyrup  Cough & Cold        300.0  12000.0  South
2         103  AntibioticX    Antibiotic          NaN  40000.0   East

In [26]:
df1[['Product_ID', 'Product_Name', 'Sales_Units']]

   Product_ID Product_Name  Sales_Units
0         101   PainRelief        500.0
1         102   CoughSyrup        300.0
2         103  AntibioticX          NaN
3         104     VitaminD        700.0
4         105  DiabetesMed        450.0
5         106      Antacid          NaN
6         107  AllergyPill        600.0
7         108      FluShot        800.0

In [33]:
df1.tail(4) # display last 5 rows by default(if you can't pass any parameters)

   Product_ID Product_Name   Category  Sales_Units  Revenue Region
4         105  DiabetesMed   Diabetes        450.0  31500.0  North
5         106      Antacid  Digestive          NaN  18000.0  South
6         107  AllergyPill    Allergy        600.0      NaN   East
7         108      FluShot    Vaccine        800.0  56000.0   West

In [34]:
df1.info() #

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Product_ID    8 non-null      int64
 1   Product_Name  8 non-null      object
 2   Category      8 non-null      object
 3   Sales_Units   6 non-null      float64
 4   Revenue       6 non-null      float64
 5   Region        8 non-null      object
dtypes: float64(2), int64(1), object(3)
memory usage: 516.0+ bytes

In [42]:
df1.describe() # it display summary of statistics

       Product_ID  Sales_Units       Revenue
count     8.00000     6.000000      6.000000
mean    104.50000   558.333333  30416.666667
std       2.44949   180.046290  15938.684596
min     101.00000   300.000000  12000.000000
25%     102.75000   462.500000  19750.000000
50%     104.50000   550.000000  28250.000000
75%     106.25000   675.000000  37875.000000
max     108.00000   800.000000  56000.000000

## Handling missing values
### Methods of handling missing valuse:
#### -Imputation: filling missing values with mean/median/mode.
#### -Deletion: remove rows/columns with missing values.

In [47]:
dc = pd.read_csv('data_clean.csv')

In [48]:
dc

     Unnamed: 0  Ozone  Solar.R  Wind Temp C Month  Day  Year  Temp Weather
0             1   41.0    190.0   7.4     67     5    1  2010    67       S
1             2   36.0    118.0   8.0     72     5    2  2010    72       C
2             3   12.0    149.0  12.6     74     5    3  2010    74      PS
3             4   18.0    313.0  11.5     62     5    4  2010    62       S
4             5    NaN      NaN  14.3     56     5    5  2010    56       S
..          ...    ...      ...   ...    ...   ...  ...   ...   ...     ...
153         154   41.0    190.0   7.4     67     5    1  2010    67       C
154         155   30.0    193.0   6.9     70     9   26  2010    70      PS
155         156    NaN    145.0  13.2     77     9   27  2010    77       S
156         157   14.0    191.0  14.3     75     9   28  2010    75       S
157         158   18.0    131.0   8.0     76     9   29  2010    76       C

[158 rows x 10 columns]

In [50]:
dc.head(5)

   Unnamed: 0  Ozone  Solar.R  Wind Temp C Month  Day  Year  Temp Weather
0           1   41.0    190.0   7.4     67     5    1  2010    67       S
1           2   36.0    118.0   8.0     72     5    2  2010    72       C
2           3   12.0    149.0  12.6     74     5    3  2010    74      PS
3           4   18.0    313.0  11.5     62     5    4  2010    62       S
4           5    NaN      NaN  14.3     56     5    5  2010    56       S

In [51]:
dc.tail()

     Unnamed: 0  Ozone  Solar.R  Wind Temp C Month  Day  Year  Temp Weather
153         154   41.0    190.0   7.4     67     5    1  2010    67       C
154         155   30.0    193.0   6.9     70     9   26  2010    70      PS
155         156    NaN    145.0  13.2     77     9   27  2010    77       S
156         157   14.0    191.0  14.3     75     9   28  2010    75       S
157         158   18.0    131.0   8.0     76     9   29  2010    76       C

In [52]:
dc.isnull()

,Unnamed: 0,Ozone,Solar.R,Wind,Temp C,Month,Day,Year,Temp,Weather
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,True,True,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
153,False,False,False,False,False,False,False,False,False,False
154,False,False,False,False,False,False,False,False,False,False
155,False,True,False,False,False,False,False,False,False,False
156,False,False,False,False,False,False,False,False,False,False
157,False,False,False,False,False,False,False,False,False,False

In [56]:
print('Missing values:\n', dc.isnull().sum()) # cal. total missing values in each column

Missing values:
 Unnamed: 0     0
Ozone         38
Solar.R        7
Wind           0
Temp C         0
Month          0
Day            0
Year           0
Temp           0
Weather        3
dtype: int64

In [ ]:
# dc.isnull(): This method generates a new DataFrame of the same size as dc, 
# but with boolean values. Each cell is True if the corresponding cell in dc is null (e.g., NaN, None, or NaT) and False otherwise.
# .sum(): When the sum() method is applied to the boolean DataFrame, it treats True as 1 and False as 0. 
#  By default, the sum is calculated down the columns (axis 0). 
# The result is a pandas Series where the index contains the column names of dc, 
# and the values represent the total count of null entries in that specific column.

In [78]:
# before imputation 
dc[['Ozone']]

     Ozone
0     41.0
1     36.0
2     12.0
3     18.0
4     30.5
..     ...
153   41.0
154   30.0
155   30.5
156   14.0
157   18.0

[158 rows x 1 columns]

In [62]:
# impute ozone with median
ozone_median = dc['Ozone'].median()
print(ozone_median)

30.5

In [83]:
w = dc['Ozone'].fillna(ozone_median)#, inplace = True)
#This parameter tells Pandas to modify the existing dc DataFrame directly rather than returning a new modified copy.

In [80]:
dc[['Ozone']]

     Ozone
0     41.0
1     36.0
2     12.0
3     18.0
4     30.5
..     ...
153   41.0
154   30.0
155   30.5
156   14.0
157   18.0

[158 rows x 1 columns]

In [95]:
solar_mean = dc['Solar.R'].mean()
print(solar_mean)

185.40397350993376

In [96]:
dc['Solar.R'].fillna(solar_mean, inplace = True)

In [114]:
dc[['Solar.R']]

        Solar.R
0    190.000000
1    118.000000
2    149.000000
3    313.000000
4    185.403974
..          ...
153  190.000000
154  193.000000
155  145.000000
156  191.000000
157  131.000000

[158 rows x 1 columns]

In [105]:
print(dc['Weather'].isna().sum())

3

In [106]:
dc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 158 entries, 0 to 157
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  158 non-null    int64
 1   Ozone       158 non-null    float64
 2   Solar.R     158 non-null    float64
 3   Wind        158 non-null    float64
 4   Temp C      158 non-null    object
 5   Month       158 non-null    object
 6   Day         158 non-null    int64
 7   Year        158 non-null    int64
 8   Temp        158 non-null    int64
 9   Weather     155 non-null    object
dtypes: float64(3), int64(4), object(3)
memory usage: 12.5+ KB

In [107]:
dc['Weather']

0       S
1       C
2      PS
3       S
4       S
       ..
153     C
154    PS
155     S
156     S
157     C
Name: Weather, Length: 158, dtype: object

In [108]:
dc['Weather'].mode()

0    S
Name: Weather, dtype: object

In [109]:
we_mode = dc['Weather'].mode()[0]
we_mode

'S'

In [110]:
dc['Weather'].fillna(we_mode, inplace = True)

In [111]:
dc['Weather'].isna().sum()

np.int64(0)

## Aggregations

In [131]:
# we = dc.groupby('Weather')
# print(we['Temp'].mean())

we = dc.groupby('Weather')['Temp'].mean()
print(np.ceil(np.array(we)))

[78. 77. 79.]

In [134]:
max_wind_speed = dc.groupby('Month')['Wind'].max()
print(max_wind_speed)

Month
5      20.1
6      20.7
7      14.9
8      15.5
9      16.6
May    12.0
Name: Wind, dtype: float64

In [147]:
df3 = pd.read_csv('salaries.csv')
df3.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [144]:
total_salary = df3.groupby('rank')['salary'].sum()
total_salary

rank
AssocProf    1193221
AsstProf     1545893
Prof         5686741
Name: salary, dtype: int64

In [151]:
max_value = df3.groupby('sex')['service'].max()
max_value

sex
Female    36
Male      51
Name: service, dtype: int64

## Sorting

### sort_values(): sort data acc. to column name
### parameters: by = columns_name , ascending = (True/False)

In [170]:
# sorted_data = dc.sort_values(by = 'Temp', ascending = False)
sorted_data = dc.sort_values(by = ['Temp', 'Month'], ascending = [False, False])

In [169]:
sorted_data[['Temp', 'Month']].head()

     Temp Month
119    97     8
121    96     8
122    94     8
120    94     8
41     93     6